/*
Задание
Создать новую таблицу back_payment, куда внести информацию о 
неоплаченных штрафах (Фамилию и инициалы водителя, 
номер машины, нарушение, сумму штрафа  и  дату нарушения) из таблицы fine.
*/

/*
Пояснение. Для неоплаченных штрафов столбец date_payment имеет пустое значение.

Важно. На этом шаге необходимо создать таблицу на основе запроса! 
Не нужно одним запросом создавать таблицу, а вторым в нее добавлять строки.
*/

CREATE TABLE back_payment AS SELECT name, number_plate, violation, sum_fine, date_violation FROM
    fine
WHERE
    date_payment IS NULL;